# Задача 2. Перевод секунд в формат чч:мм:сс

# запрашиваем значение секунд от пользователя
user_sec = int(input('Введите количество секунд >>> '))

hours = user_sec // 3600  # считаем количество часов
temp_time = user_sec % 3600  # создаем временную переменную в которую записываем оставшиеся секунды
minutes = temp_time // 60  # считаем минуты
seconds = temp_time % 60  # считаем секунды

# блок для добавления 0 к часам, минутам и секундам, если они состоят из 1 цифры
if hours < 10:
    hours = '0' + str(hours)  # переводим часы в строку и ставим перед ними 0

if minutes < 10:
    minutes = '0' + str(minutes)

if seconds < 10:
    seconds = '0' + str(seconds)

# выводим значение часов минут и секунд в формате чч:мм:сс
print(f'{user_sec} секунд это {hours}:{minutes}:{seconds}')
