# Задача 5. Расчет прибыли и рентабельности компании

# запрашиваем данные от пользователя
income = int(input('Введите доход компании >>> '))
expenses = int(input('Введите издержки компании >>> '))

# определяем прибыль или убытки
if income > expenses:
    profit = income - expenses  # размер прибыли
    print('Компания получает прибыль в размере ', profit)
    profitability = profit / income  # расчет рентабельности
    print(f'Рентабельность компании =  {profitability:.3f}')  # выводим рентабельность с 3-мя знаками после запятой

    # запрашиваем количество сотрудников и рассчитываем прибыль на 1 сотрудника
    employees_number = int(input('Введите количество сотрудников в фирме >>>'))
    employee_profit = profit / employees_number
    print(f'Прибыль на одного сотрудника = {employee_profit:.2f}')  # выводим прибыль на сотрудника с 2-мя знаками

# условие для убытков
elif income < expenses:
    print('Компания терпит убытки')
# условие для 0 прибыли
else:
    print('Компания работает в 0')
