# Задача 4. Ввод пользователем числа и вывод максимальной цифры в этом числе

# запрашиваем число от пользователя
user_number = int(input('Введите целое число'))

max_number = user_number % 10  # записываем самую правую цифру, как максимальную
temp_number = user_number // 10  # создаем переменную куда записываем число минус последняя цифра

# создаем цикл для поиска максимальной цифры проверяя каждую правую цифру отдельно
# создаем условие цикла, что число еще больше 1 цифры. Если начальное число из 1 цифры, то цикл не запускается
while temp_number != 0:

    if max_number < temp_number % 10:  # проверяем, последнюю цифру с текущим максимальным
        max_number = temp_number % 10

    temp_number = temp_number // 10  # уменьшаем текущее число на 1 цифру справа
    # тут можно добавить выход из цикла при нахождении 9, но думаю это излишне

# выводим результат
print(f'Самая большая цифра в числе {user_number} = {max_number}')
